## mysql database testing

* https://www.dataquest.io/blog/sql-insert-tutorial/

In [1]:
import numpy as np
import pandas as pd
import pymysql

from sqlalchemy import create_engine

In [2]:
engine  = create_engine('mysql+pymysql://farrell:btbgenie@localhost', pool_recycle=3600)

In [3]:
db = pymysql.connect("localhost","farrell","btbgenie","mytest" )

In [4]:
cursor = db.cursor()

## create a table

In [16]:
cursor.execute("DROP TABLE IF EXISTS SAMPLES")

# Create table
sql = """CREATE TABLE SAMPLES (
   ANIMAL_ID CHAR(20) NOT NULL,
   ALIQUOT  CHAR(20),   
   COUNTY CHAR(20),
   SPECIES CHAR(20),
   X_COORD INT,
   Y_COORD INT
   )"""

In [17]:
cursor.execute(sql)

0

## insert single rows

In [15]:
sql = "INSERT INTO `SAMPLES` (`ANIMAL_ID`,`ALIQUOT`,`COUNTY`,`SPECIES`,`X_COORD`,`Y_COORD`) VALUES (%s, %s, %s, %s, %s, %s)"

# Execute the query
cursor.execute(sql, (12323,'TB78787','Monaghan','cow',34234,434324))
db.commit()

In [5]:
sql = "SELECT * FROM `SAMPLES`"
cursor.execute(sql)

# Fetch all the records and use a for loop to print them one line at a time
result = cursor.fetchall()
for i in result:
    print(i)

('1345', 'ID-1282', 'Monaghan', 'bovine', 54, 60)
('4734', 'ID-6128', 'Monaghan', 'deer', 77, 72)
('8111', 'ID-9358', 'Monaghan', 'deer', 13, 41)
('8809', 'ID-871', 'Monaghan', 'bovine', 10, 85)
('8733', 'ID-2226', 'Monaghan', 'badger', 20, 17)
('2447', 'ID-8911', 'Monaghan', 'badger', 77, 37)
('9885', 'ID-4991', 'Monaghan', 'badger', 39, 84)
('3739', 'ID-3826', 'Monaghan', 'badger', 60, 6)
('3583', 'ID-1283', 'Wicklow', 'bovine', 37, 87)
('7848', 'ID-8124', 'Wicklow', 'badger', 80, 66)
('3816', 'ID-5920', 'Sligo', 'bovine', 15, 63)
('7588', 'ID-7186', 'Sligo', 'badger', 32, 43)
('6873', 'ID-7190', 'Monaghan', 'deer', 97, 5)
('4442', 'ID-645', 'Sligo', 'bovine', 85, 64)
('4984', 'ID-1215', 'Sligo', 'deer', 10, 87)
('8705', 'ID-865', 'Sligo', 'bovine', 95, 69)
('1609', 'ID-50', 'Sligo', 'bovine', 49, 49)
('1611', 'ID-1460', 'Monaghan', 'deer', 18, 65)
('4992', 'ID-8564', 'Wicklow', 'badger', 88, 92)
('443', 'ID-544', 'Monaghan', 'badger', 87, 92)
('1345', 'ID-1282', 'Monaghan', 'bovine', 54, 60)
('4734', 'ID-6128', 'Monaghan', 'deer', 77, 72)
('8111', 'ID-9358', 'Monaghan', 'deer', 13, 41)
('8809', 'ID-871', 'Monaghan', 'bovine', 10, 85)
('8733', 'ID-2226', 'Monaghan', 'badger', 20, 17)
('2447', 'ID-8911', 'Monaghan', 'badger', 77, 37)
('9885', 'ID-4991', 'Monaghan', 'badger', 39, 84)
('3739', 'ID-3826', 'Monaghan', 'badger', 60, 6)
('3583', 'ID-1283', 'Wicklow', 'bovine', 37, 87)
('7848', 'ID-8124', 'Wicklow', 'badger', 80, 66)
('3816', 'ID-5920', 'Sligo', 'bovine', 15, 63)
('7588', 'ID-7186', 'Sligo', 'badger', 32, 43)
('6873', 'ID-7190', 'Monaghan', 'deer', 97, 5)
('4442', 'ID-645', 'Sligo', 'bovine', 85, 64)
('4984', 'ID-1215', 'Sligo', 'deer', 10, 87)
('8705', 'ID-865', 'Sligo', 'bovine', 95, 69)
('1609', 'ID-50', 'Sligo', 'bovine', 49, 49)
('1611', 'ID-1460', 'Monaghan', 'deer', 18, 65)
('4992', 'ID-8564', 'Wicklow', 'badger', 88, 92)
('443', 'ID-544', 'Monaghan', 'badger', 87, 92)

## simulate sample data

### samples

In [6]:
counties=['Wicklow','Sligo','Monaghan']
species=['bovine','badger','deer']
coords = np.random.rand(10000, 2) * 100
data=[]
for i in range(20):
    row = (np.random.randint(10000),'ID-'+str(np.random.randint(10000)),np.random.choice(counties),np.random.choice(species),coords[i][0],coords[i][1])
    data.append(row)
    
cols = ['ANIMAL_ID','ALIQUOT','COUNTY','SPECIES','X_COORD','Y_COORD']
samples = pd.DataFrame(data,columns=cols)

In [7]:
samples[:5]

   ANIMAL_ID  ALIQUOT   COUNTY SPECIES    X_COORD    Y_COORD
0       8574  ID-2630    Sligo    deer  98.218734  53.414821
1       2581   ID-229    Sligo    deer  74.683180  31.634870
2       5279  ID-8306    Sligo  badger  35.596052   6.639199
3       2735  ID-5474  Wicklow  bovine  56.200728  90.893745
4       1265  ID-5230  Wicklow  badger  62.526709  89.687295

### snps

In [8]:
bases=['A','C','T','G']
data=[]
sites = np.random.randint(1,4e6,10)
for i in samples.ANIMAL_ID:
    for s in sites:
        row = (i,s,np.random.choice(bases),np.random.choice(bases),np.random.randint(200))
        data.append(row)
cols = ['ANIMAL_ID','POS','REF','ALT','DP']
snps = pd.DataFrame(data,columns=cols)

In [9]:
snps

     ANIMAL_ID      POS REF ALT   DP
0         8574  2985295   T   A   82
1         8574  1913023   A   A  144
2         8574  3861027   T   G  149
3         8574  1395152   T   C  189
4         8574  2096759   A   G  114
..         ...      ...  ..  ..  ...
195       4203  3347679   T   G  134
196       4203  1175528   T   T  139
197       4203  1100829   A   T   70
198       4203  3632458   A   G  181
199       4203  2843268   G   T  147

[200 rows x 5 columns]

In [20]:
sql = "SELECT * FROM `SAMPLES`"
curr = pd.read_sql(sql, db)

## insert whole dataframe

In [49]:
samples.to_sql('SAMPLES', con=engine, schema='mytest', if_exists='append', index=False, chunksize = 1000)

In [51]:
snps.to_sql('SNPS', con=engine, schema='mytest', if_exists='append', index=False, chunksize = 1000)

In [44]:
#df=df.rename(columns={'County':'COUNTY','Aliquot':'ALIQUOT'})

In [ ]:
db.close()